Repository: TableProApp/TablePro
Catalog: TablePro/Resources/Localizable.xcstrings
Source language: en
Languages: fr, ko, tr, vi, zh_hans, zh_hant

source: Check the remote path, including its capitalisation.
fr: Vérifiez le chemin distant, y compris sa majuscule.
ko: 대소문자를 포함하여 원격 경로를 확인하십시오.
tr: Uzak yolu, büyük/küçük harfleri dahil olmak üzere denetleyin.
vi: Hãy kiểm tra đường dẫn từ xa, kể cả chữ hoa chữ thường.
zh_hans: 请检查远程路径，包括其大小写。
zh_hant: 請檢查遠端路徑，包括其大小寫。

source: %@ (Copy)
fr: %@ (Copie)
ko: %@ (복사본)
tr: %@ (Kopya)
vi: %@ (Bản sao)
zh_hans: %@（副本）
zh_hant: %@（副本）

source: Open in Query Editor
fr: Ouvrir dans l'éditeur de requêtes
ko: 쿼리 편집기에서 열기
tr: Sorgu Düzenleyicide Aç
vi: Mở trong trình soạn truy vấn
zh_hans: 在查询编辑器中打开
zh_hant: 在查詢編輯器中開啟

source: Effective
fr: Efficace
ko: 적용됨
tr: Etkin
vi: Hiệu lực
zh_hans: 实际生效
zh_hant: 實際生效

source: File path inside the user's Downloads directory (returns inline data if omitted). Paths outside Downloads are rejected.
fr: Chemin de fichier à l'intérieur du répertoire Téléchargements de l'utilisateur (renvoie des données intégrées si omises). Les chemins situés en dehors de Téléchargements sont rejetés.
ko: 사용자의 다운로드 폴더 내 파일 경로입니다 (생략하면 인라인 데이터를 반환). 다운로드 폴더 외부의 경로는 거부됩니다.
tr: Kullanıcının İndirilenler klasörü içindeki dosya yolu (boş bırakılırsa veriler satır içi döndürülür). İndirilenler dışındaki yollar reddedilir.
vi: Đường dẫn tệp trong thư mục Downloads của người dùng (nếu bỏ trống sẽ trả về dữ liệu inline). Đường dẫn ngoài Downloads sẽ bị từ chối.
zh_hans: 用户“下载”目录内的文件路径（留空则返回内联数据）。“下载”目录之外的路径会被拒绝。
zh_hant: 使用者「下載」資料夾內的檔案路徑（留空則回傳內嵌資料）。「下載」資料夾之外的路徑會被拒絕。

source: Connecting
fr: De correspondance
ko: 연결 중
tr: Bağlanıyor
vi: Đang kết nối
zh_hans: 连接中
zh_hant: 連線中

source: Stop Trusting
fr: Arrêtez de faire confiance
ko: 신뢰 해제
tr: Güvenmeyi Bırak
vi: Ngừng tin cậy
zh_hans: 停止信任
zh_hant: 停止信任

source: The session is still working. Deleting it stops the reply and deletes its conversation, which can't be restored.
fr: La session fonctionne toujours. La supprimer arrête la réponse et supprime sa conversation, qui ne peut pas être restaurée.

source: Context label
fr: Étiquette de contexte
ko: 컨텍스트 레이블
tr: Bağlam etiketi
vi: Nhãn context
zh_hans: 上下文标签
zh_hant: 情境標籤

source: Maximum time for TCP, TLS, authentication, tunnel, and proxy setup. Leave blank to use the %d-second default.
fr: Temps maximum pour la configuration de TCP, TLS, d'authentification, de tunnel et de proxy. Laissez vide pour utiliser la valeur par défaut de %d secondes.

source: Generate
fr: Générer
ko: 생성
tr: Oluştur
vi: Tạo
zh_hans: 生成
zh_hant: 產生

source: Could Not Check This License
fr: Impossible de vérifier cette licence
ko: 이 라이선스를 확인하지 못했습니다
tr: Bu lisans denetlenemedi
vi: Không kiểm tra được giấy phép này
zh_hans: 无法检查此许可证
zh_hant: 無法檢查此授權

source: Formatting not supported for %@
fr: Le formatage n'est pas pris en charge pour %@
ko: %@의 서식 지정은 지원되지 않습니다
tr: %@ için biçimlendirme desteklenmiyor
vi: Không hỗ trợ định dạng cho %@
zh_hans: 不支持 %@ 的格式化
zh_hant: 不支援 %@ 的格式化

source: Find Next
fr: Trouver le suivant
ko: 다음 찾기
tr: Sonrakini Bul
vi: Tìm tiếp theo
zh_hans: 查找下一个
zh_hant: 尋找下一個

source: -- Create database %@
fr: -- Créer la base de données %@

source: Jump Hosts
fr: Hôtes de saut
ko: 점프 호스트
tr: Atlama Sunucuları
vi: Jump Host
zh_hans: Jump Host
zh_hant: 跳板主機

source: Prompt at Connect
fr: Prompt à Connect
ko: 연결 시 입력 요청
tr: Bağlanırken Sor
vi: Nhắc khi kết nối
zh_hans: 连接时提示
zh_hant: 連線時提示

source: Disk
fr: Disque

source: Status: running
fr: Statut : en cours d'exécution
ko: 상태: 실행 중
tr: Durum: çalışıyor
vi: Trạng thái: đang chạy
zh_hans: 状态：运行中
zh_hant: 狀態：執行中

source: This conversation is too long to continue. Start a new conversation and send your message there.
fr: Cette conversation est trop longue pour continuer. Lancez une nouvelle conversation et envoyez votre message là-bas.

source: No Codex CLI login found. Run codex login first, then try again.
fr: Aucun identifiant CLI Codex n'a été trouvé. Veuillez d'abord exécuter la connexion au Codex, puis réessayer.
ko: Codex CLI 로그인 정보를 찾을 수 없습니다. 먼저 codex login을 실행한 후 다시 시도하십시오.
tr: Codex CLI girişi bulunamadı. Önce codex login çalıştırın, sonra tekrar deneyin.
vi: Không tìm thấy đăng nhập Codex CLI. Hãy chạy codex login trước, rồi thử lại.
zh_hans: 未找到 Codex CLI 登录。请先运行 codex login，然后重试。
zh_hant: 找不到 Codex CLI 登入。請先執行 codex login，然後再試一次。

source: Can log in
fr: Peut se connecter
ko: 로그인 가능
tr: Oturum açabilir
vi: Có thể đăng nhập
zh_hans: 可以登录
zh_hant: 可以登入

source: Constraint name
fr: Nom de la contrainte
ko: 제약 조건 이름
tr: Kısıt adı
vi: Tên ràng buộc
zh_hans: 约束名称
zh_hant: 約束名稱

source: Reset to Inferred
fr: Réinitialiser à déduit
ko: 추론된 형식으로 재설정
tr: Çıkarsanana Sıfırla
vi: Đặt lại về giá trị suy luận
zh_hans: 重置为推断值
zh_hant: 重設為推斷值

source: Always
fr: Toujours
ko: 항상
tr: Her Zaman
vi: Luôn luôn
zh_hans: 始终
zh_hant: 永遠

source: Listing the tables both sides share.
fr: Énumérer les tables que les deux côtés partagent.

source: %@ needs a table. Pass 'table'.
fr: %@ a besoin d'une table. Passez 'table'.

source: The server did not answer the %@ panel.
fr: Le serveur n'a pas répondu au panneau %@.

source: Read-Only
fr: En lecture seule
ko: 읽기 전용
vi: Chỉ đọc
zh_hans: 只读
zh_hant: 唯讀

source: Edit as List
fr: Modifier en liste
ko: 목록으로 편집
tr: Liste Olarak Düzenle
vi: Sửa dạng danh sách
zh_hans: 以列表方式编辑
zh_hant: 以列表方式編輯

source: Moderate cost
fr: Coût modéré
ko: 중간 비용
tr: Orta maliyet
vi: Chi phí trung bình
zh_hans: 中等成本
zh_hant: 中等成本

source: System Table
fr: Tableau du système
ko: 시스템 테이블
tr: Sistem Tablosu
vi: Bảng hệ thống
zh_hans: 系统表
zh_hant: 系統資料表

source: Run Without Limit
fr: Courir sans limite

source: Drop
fr: Laisser tomber
ko: 삭제
tr: Bırak
vi: Xóa
zh_hans: 删除
zh_hant: 刪除

source: Select SQL File...
fr: Sélectionner le fichier SQL...
ko: SQL 파일 선택...
vi: Chọn tệp SQL...
zh_hans: 选择 SQL 文件...
zh_hant: 選擇 SQL 檔案…

source: Edit Comment…
fr: Modifier le commentaire...

source: Only the first %1$lld nodes were loaded, so this value was not searched in full. Switch to %2$@ to search all of it.
fr: Seuls les premiers %1$lld nœuds ont été chargés, donc cette valeur n'a pas été recherchée dans son intégralité. Changez en %2$@ pour la rechercher complètement.
ko: 처음 %1$lld개의 노드만 불러와 이 값을 전부 검색하지 못했습니다. 모든 내용을 검색하려면 %2$@ 옵션으로 전환하십시오.
tr: Yalnızca ilk %1$lld düğüm yüklendi, bu yüzden bu değer tümüyle aranmadı. Tamamını aramak için %2$@ görünümüne geçin.
vi: Chỉ %1$lld nút đầu tiên được tải, nên giá trị này chưa được tìm toàn bộ. Chuyển sang %2$@ để tìm toàn bộ.
zh_hans: 只加载了前 %1$lld 个节点，因此未完整搜索此值。切换到 %2$@ 以搜索全部内容。
zh_hant: 只載入了前 %1$lld 個節點，因此未完整搜尋此值。切換到 %2$@ 以搜尋全部內容。

source: No published port, may be unreachable
fr: Pas de port publié, peut ne pas être accessible
ko: 게시된 포트가 없어 접근하지 못할 수 있음
tr: Yayınlanmış port yok, erişilemeyebilir
vi: Không có cổng được công bố, có thể không truy cập được
zh_hans: 未发布端口，可能无法访问
zh_hant: 未發佈連接埠，可能無法連線

source: %1$lld of %2$lld statements ran inside the transaction already open on this connection. Commit it to keep them, or roll it back to discard them.
fr: %1$lld des déclarations de %2$lld ont été exécutées à l'intérieur de la transaction déjà ouverte sur cette connexion. Commettez-les pour les conserver ou annulez-les pour les rejeter.

source: Execute Query Without Limit
fr: Exécuter une requête sans limite
ko: 제한 없이 쿼리 실행
tr: Sorguyu Limitsiz Çalıştır
vi: Chạy truy vấn không giới hạn
zh_hans: 不限行数执行查询
zh_hant: 不限列數執行查詢

source: %@ is no longer a saved connection.
fr: %@ n'est plus une connexion enregistrée.
ko: %@은(는) 더 이상 저장된 연결이 아닙니다.
tr: %@ artık kayıtlı bir bağlantı değil.
vi: %@ không còn là kết nối đã lưu.
zh_hans: %@ 已不再是已保存的连接。
zh_hant: %@ 已不再是已儲存的連線。

source: Previous Month
fr: Mois précédent

source: Saved Comparisons
fr: Comparaisons enregistrées
ko: 저장된 비교
tr: Kayıtlı Karşılaştırmalar
vi: So sánh đã lưu
zh_hans: 已保存的比较
zh_hant: 已儲存的比較

source: Next Month
fr: Prochain mois

source: Reset
fr: Réinitialiser
ko: 재설정
tr: Sıfırla
vi: Đặt lại
zh_hans: 重置
zh_hant: 重設

source: Search databases...
fr: Rechercher dans les bases de données...
ko: 데이터베이스 검색...
vi: Tìm cơ sở dữ liệu...
zh_hans: 搜索数据库...
zh_hant: 搜尋資料庫…

source: SSH agent did not authenticate. Run ssh-add -l to check loaded keys.
fr: L'agent SSH n'a pas été authentifié. Exécutez ssh-add -l pour vérifier les clés chargées.
ko: SSH 에이전트가 인증하지 못했습니다. ssh-add -l을 실행하여 로드된 키를 확인하십시오.
tr: SSH aracısı kimlik doğrulaması yapmadı. Yüklü anahtarları denetlemek için ssh-add -l komutunu çalıştırın.
vi: SSH agent không xác thực được. Chạy ssh-add -l để kiểm tra các khóa đã nạp.
zh_hans: SSH 代理未通过身份验证。运行 ssh-add -l 检查已加载的密钥。
zh_hant: SSH 代理未通過驗證。請執行 ssh-add -l 檢查已載入的金鑰。

source: Import Connections…
fr: Importer les connexions...
ko: 연결 가져오기…
tr: Bağlantıları İçe Aktar…
vi: Nhập Kết nối…
zh_hans: 导入连接…
zh_hant: 匯入連線…

source: Explain the current query
fr: Expliquez la requête actuelle
ko: 현재 쿼리 설명
tr: Geçerli sorguyu açıkla
vi: Giải thích truy vấn hiện tại
zh_hans: 解释当前查询
zh_hant: 解釋目前的查詢

source: Lists system databases such as mysql and information_schema, and system schemas, in the sidebar tree and the database filter. Switchers always list them.
fr: Liste les bases de données système telles que mysql et information_schema, ainsi que les schémas système, dans l'arbre de la barre latérale et le filtre de base de données. Les commutateurs les énumèrent toujours.

source: No Field
fr: Pas de champ

source: First column
fr: Première colonne
ko: 첫 번째 열
tr: İlk sütun
vi: Cột đầu tiên
zh_hans: 第一列
zh_hant: 第一欄

source: Add columns to see the CREATE TABLE statement
fr: Ajoutez des colonnes pour voir l'instruction CREATE TABLE.
ko: CREATE TABLE 문을 보려면 열을 추가하십시오
tr: CREATE TABLE ifadesini görmek için sütun ekleyin
vi: Thêm cột để xem câu lệnh CREATE TABLE
zh_hans: 添加列以查看 CREATE TABLE 语句
zh_hant: 新增欄位以查看 CREATE TABLE 陳述式

source: That destination is not valid for this engine.
fr: Cette destination n'est pas valide pour ce moteur.

source: NULL display must be %d characters or less
fr: L'affichage NULL doit contenir %d caractères ou moins.
ko: NULL 표시 값은 %d자 이하여야 합니다
tr: NULL gösterimi en fazla %d karakter olmalıdır
vi: Hiển thị NULL phải có %d ký tự trở xuống
zh_hans: NULL显示不能超过%d个字符
zh_hant: NULL 顯示不能超過 %d 個字

source: Open Connection
fr: Connexion ouverte
ko: 연결 열기
tr: Bağlantıyı Aç
vi: Mở kết nối
zh_hans: 打开连接
zh_hant: 開啟連線

source: Metadata
fr: Métadonnées

source: This shortcut is reserved by macOS and cannot be assigned.
fr: Ce raccourci est réservé par macOS et ne peut pas être attribué.
ko: 이 단축키는 macOS에서 예약되어 있어 지정할 수 없습니다.
tr: Bu kısayol macOS tarafından ayrılmıştır ve atanamaz.
vi: Phím tắt này được macOS dành riêng và không thể gán.
zh_hans: 此快捷键已被 macOS 保留，无法分配。
zh_hant: 此快速鍵已由 macOS 保留，無法指派。

source: Exclude
fr: Exclure
ko: 제외
tr: Hariç Tut
vi: Loại trừ
zh_hans: 排除
zh_hant: 排除

source: Connection is read-only. Set safe mode to Confirm Writes or higher to allow this tool.
fr: La connexion est en lecture seule. Configurez le mode sûr sur Confirmations d'écriture ou supérieur pour autoriser cet outil.
ko: 연결이 읽기 전용입니다. 이 도구를 사용하려면 안전 모드를 쓰기 확인 이상으로 설정하십시오.
tr: Bağlantı salt okunur. Bu araca izin vermek için güvenli modu Yazmaları Onayla veya üstüne ayarlayın.
vi: Kết nối chỉ đọc. Đặt chế độ an toàn thành Xác nhận ghi hoặc cao hơn để cho phép công cụ này.
zh_hans: 连接为只读。请将安全模式设为"确认写入"或更高级别以允许此工具。
zh_hant: 連線為唯讀。請將安全模式設為「確認寫入」或更高層級以允許此工具。

source: Parent Group
fr: Groupe parental
ko: 상위 그룹
tr: Üst Grup
vi: Nhóm cha
zh_hans: 父分组
zh_hant: 上層群組

source: Not signed in to ChatGPT.
fr: Pas connecté à ChatGPT.
ko: ChatGPT에 로그인되지 않았습니다.
tr: ChatGPT'ye giriş yapılmadı.
vi: Chưa đăng nhập ChatGPT.
zh_hans: 未登录 ChatGPT。
zh_hant: 尚未登入 ChatGPT。

source: Its indexes are left out, because the target is not known to take indexes on this kind of object.
fr: Ses index sont omis, car il n'est pas connu que la cible prenne des index sur ce type d'objet.

source: Waiting for your startup commands
fr: En attente de vos commandes de démarrage.

source: Quote Identifiers
fr: Identifiants de citation
ko: 식별자 인용
tr: Tanımlayıcıları Tırnakla
vi: Trích dẫn định danh
zh_hans: 为标识符加引号
zh_hant: 為識別符號加引號

source: Compare the two databases first.
fr: Commencez par comparer les deux bases de données.
ko: 먼저 두 데이터베이스를 비교하십시오.
tr: Önce iki veritabanını karşılaştırın.
vi: Hãy so sánh hai cơ sở dữ liệu trước.
zh_hans: 请先比较这两个数据库。
zh_hant: 請先比較這兩個資料庫。

source: SSL Mode
fr: Mode SSL
ko: SSL 모드
tr: SSL Modu
vi: Chế độ SSL
zh_hans: SSL 模式
zh_hant: SSL 模式

source: Rows are written into tables that already exist on the destination.
fr: Les lignes sont écrites dans des tables qui existent déjà sur la destination.

source: Remove filter
fr: Supprimer le filtre
ko: 필터 제거
tr: Filtreyi kaldır
vi: Xóa bộ lọc
zh_hans: 移除筛选
zh_hant: 移除篩選

source: Choose a project folder to read its database settings.
fr: Choisissez un dossier de projet pour lire ses paramètres de base de données.
ko: 데이터베이스 설정을 읽을 프로젝트 폴더를 선택하십시오.
tr: Veritabanı ayarlarını okumak için bir proje klasörü seçin.
vi: Chọn một thư mục dự án để đọc cài đặt cơ sở dữ liệu trong đó.
zh_hans: 选择一个项目文件夹以读取其中的数据库设置。
zh_hant: 選擇一個專案資料夾以讀取其中的資料庫設定。

source: Enter Below
fr: Entrez ci-dessous

source: 2 spaces
fr: 2 espaces
ko: 공백 2개
tr: 2 boşluk
vi: 2 dấu cách
zh_hans: 2 个空格
zh_hant: 2 個空格

source: Refresh Materialized View…
fr: Recharger la vue matérialisée...

source: Key %1$@ matches more than one row in the %2$@. Choose key columns that identify a single row.
fr: La clé %1$@ correspond à plus d'une ligne dans le %2$@. Choisissez les colonnes clés qui identifient une seule ligne.

source: Allow every held-back statement on the Warnings tab, or exclude the objects that produced them, before applying.
fr: Autorisez chaque déclaration retenue dans l'onglet Avertissements, ou excluez les objets qui les ont produites, avant d'appliquer.
ko: 적용하기 전에 경고 탭에서 보류된 구문을 모두 허용하거나, 해당 구문을 만든 객체를 제외하십시오.
tr: Uygulamadan önce Uyarılar sekmesinde tutulan her ifadeye izin verin veya bunları üreten nesneleri hariç tutun.
vi: Trước khi áp dụng, hãy cho phép mọi câu lệnh bị giữ lại ở tab Cảnh báo, hoặc loại trừ các đối tượng đã tạo ra chúng.
zh_hans: 应用前，请在“警告”标签中允许每条被保留的语句，或排除产生它们的对象。
zh_hant: 套用前，請在「警告」標籤中允許每條被保留的陳述式，或排除產生它們的物件。

source: Paused after %d tool calls.
fr: Pausé après %d appels d'outils.
ko: 도구 호출 %d회 후 일시 정지되었습니다.
tr: %d araç çağrısından sonra duraklatıldı.
vi: Đã tạm dừng sau %d lần gọi công cụ.
zh_hans: 已在 %d 次工具调用后暂停。
zh_hant: 已在 %d 次工具呼叫後暫停。

source: No Rows Match
fr: Aucune ligne ne correspond
ko: 일치하는 행 없음
tr: Eşleşen Satır Yok
vi: Không có dòng nào khớp
zh_hans: 没有匹配的行
zh_hant: 沒有相符的列

source: Exclude Every Listed Row
fr: Exclure chaque ligne répertoriée

source: Review & Apply…
fr: Examen et candidature...
ko: 검토 및 적용…
tr: Gözden Geçir ve Uygula…
vi: Xem lại và áp dụng…
zh_hans: 检查并应用…
zh_hant: 檢視並套用…

source: Raw result columns
fr: Colonnes de résultats bruts
ko: 원시 결과 열
tr: Ham sonuç sütunları
vi: Cột kết quả thô
zh_hans: 原始结果列
zh_hant: 原始結果欄位

# %d of %d rows selected
source: %1$d of %2$d rows selected
fr: %1$d de %2$d lignes sélectionnées
ko: %1$d/%2$d행 선택됨
tr: %d / %d satır seçildi
vi: Đã chọn %d trên %d dòng
zh_hans: 已选择%d/%d行
zh_hant: 已選取 %1$d / %2$d 列

source: Toggle Results
fr: Changer les résultats
ko: 결과 표시/숨기기
tr: Sonuçları Aç/Kapat
vi: Ẩn/hiện kết quả
zh_hans: 显示/隐藏结果
zh_hant: 顯示/隱藏結果

source: User denied MCP access to this connection
fr: L'utilisateur a refusé l'accès de MCP à cette connexion.
ko: 사용자가 이 연결에 대한 MCP 접근을 거부했습니다
tr: Kullanıcı bu bağlantıya MCP erişimini reddetti
vi: Người dùng đã từ chối quyền truy cập MCP cho kết nối này
zh_hans: 用户拒绝了此连接的 MCP 访问
zh_hant: 使用者拒絕了此連線的 MCP 存取

source: This database cannot skip rows, so offset must be 0. Narrow the rows with filters or a sort instead.
fr: Cette base de données ne peut pas sauter de lignes, donc l'écart doit être égal à 0. Rétrécissez les lignes avec des filtres ou un tri à la place.

source: Search Query History
fr: Historique des requêtes de recherche
ko: 쿼리 기록 검색
tr: Sorgu Geçmişinde Ara
vi: Tìm trong lịch sử truy vấn
zh_hans: 搜索查询历史记录
zh_hant: 搜尋查詢歷程記錄

source: Earlier Version
fr: Version précédente

source: At their declared lengths the columns pass MySQL's 65,535-byte row limit, so this one is %@, which does not enforce a length.
fr: À leurs longueurs déclarées, les colonnes dépassent la limite de lignes de 65 535 octets de MySQL, donc celle-ci est %@, ce qui ne fixe pas de longueur.

source: Stop
fr: Arrêter
ko: 중지
vi: Dừng
zh_hans: 停止
zh_hant: 停止

source: Agent Socket
fr: Socket d'agent
ko: 에이전트 소켓
tr: Aracı Soketi

source: Decrease font size
fr: Réduire la taille de la police
ko: 글꼴 크기 줄이기
tr: Yazı boyutunu küçült
vi: Giảm cỡ chữ
zh_hans: 减小字号
zh_hant: 縮小字型大小

source: Top Values
fr: Meilleurs valeurs

source: No plugin developers trusted yet.
fr: Aucun développeur de plugins n'est encore fiable.
ko: 아직 신뢰하는 플러그인 개발자가 없습니다.
tr: Henüz güvenilen eklenti geliştiricisi yok.
vi: Chưa tin cậy nhà phát triển plugin nào.
zh_hans: 尚未信任任何插件开发者。
zh_hant: 尚未信任任何外掛開發者。

source: Looked up in ~/.pgpass by the host, port, database and username of whichever connection is opening.
fr: Cherché dans ~/.pgpass par l'hôte, le port, la base de données et le nom d'utilisateur de la connexion qui s'ouvre.

source: Column default expression
fr: Expression par défaut de la colonne
ko: 열 기본값 표현식
tr: Sütun varsayılan ifadesi
vi: Biểu thức mặc định của cột
zh_hans: 列默认值表达式
zh_hant: 欄位預設值運算式

source: The type's shape, such as enum, composite, domain, range, aliasType, tableType or clrType
fr: La forme du type, tel que enum, composite, domaine, plage, aliasType, tableType ou clrType.

source: Export…
fr: Exporter...
ko: 내보내기…
tr: Dışa Aktar…
vi: Xuất…
zh_hans: 导出…
zh_hant: 匯出…

source: Every query you run is saved. Choose View > Show Query History to search them and load one back into the editor.
fr: Chaque requête que vous exécutez est enregistrée. Choisissez Afficher > Afficher l'historique des requêtes pour les rechercher et les charger à nouveau dans l'éditeur.
ko: 실행한 모든 쿼리는 저장됩니다. 보기 > 쿼리 기록 보기를 선택하여 검색하고 편집기로 다시 불러오세요.
tr: Çalıştırdığınız her sorgu kaydedilir. Aramak ve birini düzenleyiciye geri yüklemek için Görünüm > Sorgu Geçmişini Göster öğesini seçin.
vi: Mọi truy vấn bạn chạy đều được lưu. Chọn Xem > Hiện lịch sử truy vấn để tìm và nạp lại một truy vấn vào trình soạn thảo.
zh_hans: 你运行的每条查询都会被保存。选择“显示 > 显示查询历史”搜索它们，并将其中一条载回编辑器。
zh_hant: 你執行的每個查詢都會儲存。選擇「顯示方式 > 顯示查詢記錄」搜尋它們，並將其中一個載回編輯器。

source: Merge Columns…
fr: Fusionner les colonnes...
ko: 열 병합…
tr: Sütunları Birleştir…
vi: Gộp cột…
zh_hans: 合并列…
zh_hant: 合併欄位…

source: “%1$@” is encoded as %2$@, which can't represent some of the text in its tab. The file was not changed. Use Save As to save the text as UTF-8.
fr: « %1$@ » est encodé en %2$@, ce qui ne peut pas représenter une partie du texte dans son onglet. Le fichier n’a pas été modifié. Utilisez Enregistrer sous pour enregistrer le texte en UTF-8.
ko: “%1$@”은(는) %2$@(으)로 인코딩되어 있어 탭의 일부 텍스트를 나타낼 수 없습니다. 파일은 변경되지 않았습니다. 텍스트를 UTF-8로 저장하려면 다른 이름으로 저장을 사용하세요.
tr: “%1$@” %2$@ ile kodlanmış ve bu kodlama sekmedeki metnin bir kısmını gösteremiyor. Dosya değiştirilmedi. Metni UTF-8 olarak kaydetmek için Farklı Kaydet'i kullanın.
vi: “%1$@” được mã hoá bằng %2$@, không thể biểu diễn một phần văn bản trong tab. Tệp không bị thay đổi. Dùng Lưu thành để lưu văn bản dưới dạng UTF-8.
zh_hans: “%1$@”的编码为 %2$@，无法表示标签页中的部分文本。文件未被更改。请使用“存储为”将文本存储为 UTF-8。
zh_hant: 「%1$@」的編碼為 %2$@，無法表示標籤頁中的部分文字。檔案未被更改。請使用「儲存為」將文字儲存為 UTF-8。

source: Leave blank to find it on your PATH. Apps launched from the Dock do not inherit your shell's PATH, so a tool installed somewhere unusual needs its full path here.
fr: Laissez vide pour le trouver sur votre PATH. Les applications lancées depuis le Dock ne héritent pas le PATH de votre shell, donc un outil installé quelque part d'inhabituel a besoin de son chemin complet ici.

source: Page Count
fr: Nombre de pages
ko: 페이지 수
tr: Sayfa Sayısı
vi: Số trang
zh_hans: 页面数
zh_hant: 頁數

source: Run Script
fr: Exécuter le script
ko: 스크립트 실행
tr: Betiği Çalıştır
vi: Chạy script
zh_hans: 运行脚本
zh_hant: 執行指令碼

source: Integrations…
fr: Intégrations...
ko: 통합…
tr: Entegrasyonlar…
vi: Tích hợp…
zh_hans: 集成…
zh_hant: 整合…

source: Structure changes
fr: Changements de structure
ko: 구조 변경
tr: Yapı değişiklikleri
vi: Thay đổi cấu trúc
zh_hans: 结构更改
zh_hant: 結構變更

# Enter the %@ for "%@"
source: Enter the %1$@ for "%2$@"
fr: Entrez le %1$@ pour "%2$@"
ko: 다음 항목의 %1$@을(를) 입력하십시오: "%2$@"
tr: "%@" için %@ girin
vi: Nhập %@ cho "%@"
zh_hans: 输入"%@"的 %@
zh_hant: 輸入「%1$@」的 %2$@

source: %1$@ (%2$lld of %3$lld still present)
fr: %1$@ (%2$lld de %3$lld toujours présent)

source: Connection Options
fr: Options de connexion
ko: 연결 옵션
tr: Bağlantı seçenekleri
vi: Tùy chọn kết nối
zh_hans: 连接选项
zh_hant: 連線選項

source: The session is waiting on your answer about a statement. Closing it cancels the statement, and its conversation stays in the list.
fr: La session attend votre réponse concernant une déclaration. La fermer annule la déclaration et sa conversation reste dans la liste.

source: The query exceeds the 100KB limit.
fr: La requête dépasse la limite de 100 Ko.
ko: 쿼리가 100KB 제한을 초과합니다.
tr: Sorgu 100KB sınırını aşıyor.
vi: Truy vấn vượt quá giới hạn 100KB.
zh_hans: 查询超过了 100KB 的限制。
zh_hant: 查詢超過了 100KB 的限制。

source: This connection has no %@ yet.
fr: Cette connexion n'a pas encore de %@.

source: Open Connections
fr: Connections ouvertes
ko: 연결 목록 열기
tr: Açık Bağlantılar
vi: Kết nối đang mở
zh_hans: 已打开的连接
zh_hant: 已開啟的連線

source: SSH private key rejected. Check the key file or passphrase.
fr: Clé privée SSH rejetée. Vérifiez le fichier clé ou le mot de passe.
ko: SSH 개인 키가 거부되었습니다. 키 파일 또는 암호를 확인하십시오.
tr: SSH özel anahtarı reddedildi. Anahtar dosyasını veya parola ifadesini denetleyin.
vi: Private key SSH bị từ chối. Kiểm tra file khóa hoặc passphrase.
zh_hans: SSH 私钥被拒绝。请检查密钥文件或密码短语。
zh_hant: SSH 私密金鑰被拒絕。請檢查金鑰檔案或密碼短語。

source: The %d statements before it stay applied.
fr: Les déclarations %d précédentes restent applicables.

source: Deleted connection (%@)
fr: Connexion supprimée (%@)
ko: 연결 삭제됨(%@)
tr: Silinen bağlantı (%@)
vi: Đã xóa kết nối (%@)
zh_hans: 已删除的连接（%@）
zh_hant: 已刪除的連線 (%@)

source: This connection won't sync to other devices via iCloud.
fr: Cette connexion ne se synchronisera pas avec d'autres appareils via iCloud.
ko: 이 연결은 iCloud를 통해 다른 기기와 동기화되지 않습니다.
tr: Bu bağlantı iCloud üzerinden diğer cihazlarla eşitlenmeyecek.
vi: Kết nối này sẽ không đồng bộ sang thiết bị khác qua iCloud.
zh_hans: 此连接不会通过 iCloud 同步到其他设备。
zh_hant: 此連線不會透過 iCloud 同步到其他裝置。

source: Connection Failed
fr: Échec de la connexion
ko: 연결 실패
tr: Bağlantı Başarısız
vi: Kết nối thất bại
zh_hans: 连接失败
zh_hant: 連線失敗

source: Click to show all tables with metadata
fr: Cliquez pour afficher toutes les tables avec des métadonnées.
ko: 메타데이터가 포함된 모든 테이블을 표시하려면 클릭하십시오
tr: Tüm tabloları meta verilerle göstermek için tıklayın
vi: Nhấn để hiện tất cả bảng với siêu dữ liệu
zh_hans: 点击显示所有表及其元数据
zh_hant: 點按以顯示所有資料表及其中繼資料

source: Execution
fr: Exécution
ko: 실행
tr: Çalıştırma
vi: Thực thi
zh_hans: 执行
zh_hant: 執行

source: Sign-in timed out
fr: Délai d'inscription écoulé
ko: 로그인 시간이 초과되었습니다
tr: Oturum açma zaman aşımına uğradı
vi: Đăng nhập hết thời gian chờ
zh_hans: 登录超时
zh_hant: 登入逾時

source: Editor Font
fr: Police d'édition
ko: 편집기 글꼴
tr: Düzenleyici Yazı Tipi
vi: Phông chữ trình soạn thảo
zh_hans: 编辑器字体
zh_hant: 編輯器字型

source: Move Groups
fr: Mouvement de groupes

source: Status:
fr: Statut :
ko: 상태:
tr: Durum:
vi: Trạng thái:
zh_hans: 状态：
zh_hant: 狀態：

source: The target could not be read: %@
fr: La cible ne pouvait pas être lu : %@

# Page %d of %d
source: Page %1$d of %2$d
fr: Page %1$d sur %2$d
ko: 페이지 %1$d / %2$d
tr: Sayfa %1$d / %2$d
vi: Trang %1$d / %2$d
zh_hans: 第 %1$d 页，共 %2$d 页
zh_hant: 第 %1$d 頁，共 %2$d 頁

source: AI Policy
fr: Politique IA
ko: AI 정책
tr: Yapay Zeka İlkesi
vi: Chính sách AI
zh_hans: AI 策略
zh_hant: AI 政策
